## .zsh_plugins.txt

# fish like abbreviation
olets/zsh-abbr     kind:defer

# set up zsh completions
zsh-users/zsh-completions     kind:fpath path:src

# prompts:
# with prompt plugins, remember to add this to your .zshrc:
#   `autoload -Uz promptinit && promptinit && prompt powerlevel10k`
romkatv/powerlevel10k     kind:fpath

# popular fish-like plugins
zsh-users/zsh-autosuggestions
zap-zsh/supercharge
zdharma-continuum/fast-syntax-highlighting    kind:defer
zap-zsh/sudo    kind:defer
zsh-users/zsh-history-substring-search
joshskidmore/zsh-fzf-history-search     kind:defer

# frameworks like oh-my-zsh are supported
getantidote/use-omz        # handle OMZ dependencies
ohmyzsh/ohmyzsh path:plugins/colored-man-pages     kind:defer
ohmyzsh/ohmyzsh path:plugins/command-not-found     kind:defer
